Revit 2026 API

# UnitUtilsIsSymbol Method

---

Checks whether a ForgeTypeId identifies a symbol.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static bool IsSymbol(
	ForgeTypeId symbolTypeId
)
```
```vb
Public Shared Function IsSymbol (
	symbolTypeId As ForgeTypeId
) As Boolean
```
```cpp
public:
static bool IsSymbol(
	ForgeTypeId^ symbolTypeId
)
```
```fsharp
static member IsSymbol :
        symbolTypeId : ForgeTypeId -> bool
```

#### Parameters

symbolTypeId ForgeTypeId
     The identifier to check.

#### Return Value

Boolean True if the ForgeTypeId identifies a symbol, false otherwise.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

The SymbolTypeId class offers symbol identifiers.

#### Reference

UnitUtils Class

Autodesk.Revit.DB Namespace